<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"992a2861c4b8795823c5a5895117bbedc7931de353a20bd3293807d3c6e8bfac","plan_job_ref":"Job Terraform Plan #707 at https://github.com/cal-itp/data-infra/actions/runs/20087440615","plan_out_hash":"cb3f62f86c19e88150ee04fb322c36d44f029096e652da1630ab4bc70c7fda89","plan_hash":"b46126619048c2019699569b1a2d6cdb49b1ad4692a5e1c913ad4a7a56a3bc42","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/dashboards/us__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # metabase_collection.reports will be created
+   resource "metabase_collection" "reports" {
+       description = "Contains reports accessible to business analysts."
+       entity_id   = (known after apply)
+       id          = (known after apply)
+       location    = (known after apply)
+       name        = "Reports"
+       slug        = (known after apply)
    }

  # metabase_collection_graph.graph will be created
+   resource "metabase_collection_graph" "graph" {
+       permissions = [
+           {
+               collection = (known after apply)
+               group      = (known after apply)
+               permission = "write"
            },
        ]
+       revision    = (known after apply)
    }

  # metabase_database.bigquery will be created
+   resource "metabase_database" "bigquery" {
+       bigquery_details = {
+           dataset_filters_patterns = "gtfs"
+           dataset_filters_type     = "inclusion"
+           project_id               = "**************************"
+           service_account_key      = (sensitive value)
        }
+       id               = (known after apply)
+       name             = "bigquery"
    }

  # metabase_permissions_graph.graph will be created
+   resource "metabase_permissions_graph" "graph" {
+       advanced_permissions = false
+       permissions          = [
+           {
+               create_queries = "query-builder-and-native"
+               database       = (known after apply)
+               group          = (known after apply)
+               view_data      = "unrestricted"
            },
        ]
+       revision             = (known after apply)
    }

  # metabase_permissions_group.data-analysts will be created
+   resource "metabase_permissions_group" "data-analysts" {
+       id   = (known after apply)
+       name = "Data Analysts"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #707](https://github.com/cal-itp/data-infra/actions/runs/20087440615)